[{"UID":"1","abstract":"Autonomous driving represents one of the most challenging applications of embodied AI, requiring real-time perception, prediction, and planning at scale. This talk will explore how foundation models and large-scale neural networks are being deployed in production autonomous systems. We will discuss the engineering challenges of deploying vision-language-action models in safety-critical applications, including model compression, latency optimization, and robustness guarantees. The talk will cover Tesla's approach to building end-to-end neural networks for autonomous driving, from multi-camera vision to trajectory planning, and the lessons learned from deploying these systems to millions of vehicles worldwide.","bio":"TBD","image":"https://scholar.googleusercontent.com/citations?view_op=medium_photo&user=yVhkUZwAAAAJ&citpid=2","institution":"Tesla","session":"1","speaker":"Ashok Elluswamy","title":"Building an Autonomous Future"},{"UID":"2","abstract":"Motion forecasting is a critical component of autonomous driving systems, requiring accurate prediction of multi-agent behaviors in complex urban environments. This talk will present advances in end-to-end learning approaches for motion forecasting, where large foundation models learn to predict future trajectories directly from sensor inputs. We will discuss how knowledge distillation techniques enable deploying these powerful models efficiently on edge devices while maintaining prediction accuracy. The presentation will cover Waymo's research on transformer-based architectures for multi-agent prediction, the challenges of training and deploying these models at scale, and recent advances in distilling complex forecasting models into production-ready systems.","bio":"TBD","image":"https://cap.csail.mit.edu/sites/default/files/styles/spotlight_photo/public/people-images/Drago_Anguelov_Waymo.JPG?h=84efa7b9&itok=F6KATtLw","institution":"Waymo","session":"1","speaker":"Dragomir Anguelov","title":"End-to-End Motion Forecasting and Distillation"},{"UID":"3","abstract":"Embodied AI represents a paradigm shift in autonomous driving, where agents learn to drive through end-to-end learning from sensor data to control signals. This talk will explore the frontiers of embodied AI for autonomous driving, focusing on how foundation models can be adapted and deployed for real-world driving tasks. We will discuss the challenges of learning robust driving policies from diverse data, the role of world models in planning and simulation, and how vision-language-action models can enable more generalizable autonomous systems. The presentation will cover Wayve's approach to end-to-end learning for autonomous driving, including recent advances in foundation model architectures, data efficiency, and deployment strategies that enable safe and scalable autonomous systems.","bio":"TBD","image":"https://alexgkendall.com/assets/images/alex.jpg","institution":"Wayve","session":"1","speaker":"Alex Kendall","title":"Frontiers in Embodied AI for Autonomous Driving"},{"UID":"4","abstract":"","bio":null,"image":"https://media.licdn.com/dms/image/v2/C4E03AQFhKe6JzI0NZA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1517691205410?e=1770249600&v=beta&t=vwq2J18eR6yG3jLIfM8OJuptrztraKHFGhTL0-9Y1S0","institution":"Uber","session":null,"speaker":"Danny Guo","title":""},{"UID":"5","abstract":"Embodied AI represents a paradigm shift in autonomous driving, where agents learn to drive through end-to-end learning from sensor data to control signals. This talk will explore the frontiers of embodied AI for autonomous driving, focusing on how foundation models can be adapted and deployed for real-world driving tasks. We will discuss the challenges of learning robust driving policies from diverse data, the role of world models in planning and simulation, and how vision-language-action models can enable more generalizable autonomous systems. The presentation will cover Wayve's approach to end-to-end learning for autonomous driving, including recent advances in foundation model architectures, data efficiency, and deployment strategies that enable safe and scalable autonomous systems.","bio":"TBD","image":"https://scholar.googleusercontent.com/citations?view_op=medium_photo&user=P9FclNEAAAAJ&citpid=1","institution":"NVIDIA","session":"1","speaker":"Jan Kautz","title":"Frontiers in Embodied AI for Autonomous Driving"},{"UID":"6","abstract":"","bio":null,"image":"https://www.cs.utexas.edu/~pstone/images/Peter_Headshot_2019.png","institution":"Sony AI","session":null,"speaker":"Peter Stone","title":""}]
